Repository: s-ball/pyimgren
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: fr

source: API reference
fr: Référence des API

source: :mod:`pyimgren` module
fr: Module :mod:`pyimgren`

source: This module imports :py:class:`pyimgren.renamer.Renamer` and the function :py:func:`pyimgren.renamer.nls_init`. It also defines the following constants:
fr: Ce module importe :py:class:`pyimgren.renamer.Renamer` et la fonction :py:func:`pyimgren.renamer.nls_init`. Il définit également les constantes suivantes :

source: the name of the package (``pyimgren``)
fr: le nom du paquet (``pyimgren``)

source: the current version of the package (|release|)
fr: la version courante du paquest (|release|)

source: :mod:`pyimgren.renamer` module
fr: Module :mod:`pyimgren.renamer`

source: Implementation of the package
fr: Implémentation du paquet

source: Initialize the package for i18n
fr: Initialise le paquet pour les fonctions d'internationalisation

source: Parameters
fr: Paramètres

source: Indicates whether i18n should be setup (if True) or removed (if False)
fr: Indique si le mode i18n doit être activé (si True) ou non (si False)

source: Returns: the name of the locale currently used by the package
fr: Valeur de retour: nom du paramètre régional utilisé par le paquet

source: Base for pyimgren exceptions
fr: Classe de base des exceptions de pyimgren

source: Raised when a line in the names.log file cannot be parsed
fr: Levée quand une ligne du fichier names.log ne peut être analysée

source: line number where the problem occurs
fr: numéro de la ligne où se situe le problème

source: content of the offending line
fr: contenu de la ligne en erreur

source: Raised when trying to rename back a file not registered in the ref_file
fr: Levée en essayant de redonner un nom original à un fichier qui n'est pas enregistré dans le fichier ref_file

source: name of the unknown image
fr: nom de l'image inconnue

source: the reference file (names.txt) of the Renamer
fr: le fichier de référence (names.txt) du Renamer

source: the (output) folder of the Renamer
fr: le dossier (de sortie) du Renamer

source: Raised when trying to merge one directory into itself.
fr: Levée en essayant de fusionner un répertoire dans lui-même

source: name of the directory
fr: nom du répertoire

source: Main class of the module.
fr: Classe principale du module.

source: A Renamer is used to rename image names provided by a camera (commonly IMGxxxxx.JPG or DSCFyyyy.JPG) into a name based on the time when the photography had been taken (as smartphones do). That time is extracted from the exif tag of the picture. No rename occurs if the picture contains no exif time.
fr: Un Renamer sert à renommer des noms d'images produits par un appareil photo (couramment IMGxxxxx.JPG ou DSCFyyyy.JPG) avec un nom basé sur le moment où la photographie a été prise (comme le font les smartphones). Ce moment est récupéré dans les propriétés *Exif* de l'image. L'image n'est pas renommée si elle ne contient pas une date et heure exif.

source: the folder where pictures will be renamed
fr: le dossier contenant les images à renommer

source: a format containing strftime formatting directives, that will be used for the new name of a picture (default "%Y%m%d_%H%M%S")
fr: un format contenant des directives de formattage pour ``strftime``, qui sera utilisé pour le nouveau nom d'une image (par défaut "%Y%m%d_%H%M%S")

source: the extension of the new name
fr: l'extension du nouveau nom

source: the name of a file that will remember the old names (default names.log)
fr: le nom d'un fichier qui enregistrera les anciens noms (default names.log)

source: All parameters become attribute of the object with the same name
fr: Tous les paramètres deviennent des attributs de l'object, avec le même nom

source: a number of minutes to add to the time found in exif data. This is intended to cope with a camera having a wrong time (default 0)
fr: un nombre de minutes à ajouter à l'heure extraite des données exif. Le but est de gérer le cas où l'appareil photo n'est pas à l'heure (par défaut 0)

source: a boolean flag that will cause a line to be printed for each rename when true (default false)
fr: un drapeau bouléen qui fait afficher une ligne par fichier renommé quand il est vrai (par défaut faux)

source: a boolean flag that will cause a "dry run", meaning that the folder will be scanned, and debug info eventually printed but no file will be renamed (default false)
fr: un drapeau bouléen qui provoque un fonctionnement à blanc (*dry run*), c'est à dire que le dossier sera parcouru, et les informations de déverminage (*debug*) éventuellement affichés mais qu'aucun fichier ne sera renommé (par défault faux)

source: log: an object respecting a logging.Logger interface. By default,
fr: un object respectant l'interface d'un ``logging.Logger``. Par défaut

source: A file named names.log is created in the folder to store the new names and the original ones, in order to be able to rename them back.
fr: Un fichier nommé names.log est créé dans le dossier pour enregistrer les nouveaux noms et les anciens, afin de pouvoir leur rendre leur nom d'origine.

source: This class requires piexif and Python >= 3.
fr: Cette classe nécessite piexif et Python >= 3.

source: an iterable of names of files to rename (they must be in the Renamer folder). If a name contains wildcard characters (* and ?), all files matching that pattern will be renamed.
fr: un itérable de noms de fichiers à renommer (ils doivent être dans le dossier du Renamer). Si un nom contient des caractères génériques, tous les fichiers correspondants à ce modèle seront traités.

source: a number of minutes to add to the time found in exif data. This is intended to cope with a camera having a wrong time
fr: un nombre de minutes à ajouter à l'heure extraite des données exif. Le but est de gérer le cas où l'appareil photo n'est pas à l'heure

source: a boolean flag that will cause a line to be printed for each rename when true
fr: un drapeau bouléen qui fait afficher une ligne par fichier renommé quand il est vrai

source: a boolean flag that will cause a "dry run", meaning that the folder will be scanned, and debug info eventually printed but no file will be renamed
fr: un drapeau bouléen qui provoque un fonctionnement à blanc (*dry run*), c'est à dire que le dossier sera parcouru, et les informations de déverminage (*debug*) éventuellement affichés mais qu'aucun fichier ne sera renommé

source: Uses load_names to load the names.log file, and get_new_name to avoid collisions in file names.
fr: Utilise load_names pour charger le fichier names.log, et get_new_name pour éviter les collisions dans les noms de fichier.

source: Raises
fr: Lève une exception

source: if for a destination name, all files from a to zz already exist
fr: si pour un nom de destination, tous les fichiers de a à zz existent déjà

source: Rename pictures back to their initial name in folder (by default all pictures known in ref file)
fr: Redonne aux images leur nom initial dans le dossier (par défaut toutes les images connues dans ref_file)

source: an iterable of names. If one name exists in the local ref_file, that file will be renamed back. If it contains wildcard characters (* and ?), all files matching that pattern will be processed.
fr: un itérable de noms. Si un nom existe dans le fichier ref_file local, ce fichier retrouvera son nom initial. S'il contient des caractères génériques, tous les fichiers correspondants à ce modèle seront traités.

source: Uses load_names to load the names.log file.
fr: Utilise load_names pour charger le fichier names.log.

source: Merge files from a different folder.
fr: Fusionne des fichiers provenant d'un autre dossier.

source: file names or patterns containing wildcard characters (* or?) defining the files to be copied.
fr: noms de fichiers ou modèles contenant des caractères génériques (* ou ?) définissant les fichiers à copier.

source: the name of the folder containing the files to merge. It cannot contain wildcard characters.
fr: le nom du dossier contenant les fichiers à fusionner. Il ne doit pas contenir de caractères génériques.

source: If src_folder is given it is used as a start path component for all relative paths in files.
fr: Si src_folder est présent, il sert de valeur initiale pour tous les chemins relatifs de files.

source: The files are not moved but remain in their original folder. As usual, the copies receive a name based on their exif timestamp encoded by strftime using dst_mask and dst_ext.
fr: Les fichiers ne sont pas déplacés mais restent dans leur dossier d'origine. Comme d'habitude, les copies reçoivent un nom basé sur leur date et heure exif encodé par `strftime` en utilisant dst_mask et dst_ext.

source: If a name matches a directory, the directory is ignored and a warning is issued.
fr: Si un nom correspond a un répertoire, le répertoire est ignoré et un message d'avertissement est affiché.

source: if all files from a to zz already exist
fr: si tous les fichiers de a à zz existent déjà

source: Load new and original names from a names.log file.
fr: Charge les noms nouveaux et anciens depuis un fichier names.log.

source: Returns
fr: Retourne

source: the keys of the dict are the new names of the renamed pictures and the values are the original names
fr: les clés du dictionnaire sont les nouveaux noms des images renommées et les valeurs sont les noms d'origine

source: Return type
fr: Type de la valeur de retour

source: the attributes of the NamesLogException are the number of the offending line and its content if a line in names.log contains no colon (:)
fr: les attributs de la NamesLogException sont le numéro de la ligne en erreur et son contenu si une ligne de names.log ne contient pas de deux point (:)

source: Finds the final name of a picture if a file with that name
fr: Trouve le nom définitif d'une image si un fichier avec ce nom

source: already exists.
fr: existe déjà.

source: the name (without the extension which shall be ext_mask)
fr: le nom (sans l'extension qui doit être ext_mast)

source: a name composed with * the value of name * a suffix between a and zz until a file of that name does not exist in the directory * ext_mask
fr: un nom composé de * la valeur du nom * un suffixe entre a et zz jusqu'à ce qu'un fichier de ce nom n'existe pas dans le dossier * ext_mask

source: a name composed with
fr: un nom composé de

source: the value of name
fr: la valeur du nom

source: a suffix between a and zz until a file of that name does not exist in the directory
fr: un suffixe entre a et zz jusqu'a ce qu'un fichier de ce nom n'existe pas dans le répertoire

source: Extract the timestamp of a picture file from the exif tags.
fr: Extrait la date et l'heure d'un fichier image à partir de ses champs exif.

source: This function is a wrapper around the piexif module to easily find the date and time when the picture was taken. It first tries the time when the camera took the picture, then the time when the file was writen on the memory card.
fr: Cette function est un habillage autour du module piexif pour trouver facilement la date et l'heure à laquelle la photographie a été prise. Elle essaie d'abord le moment où l'appareil a pris la photographie, puis le moment où le fichier a été enregistré sur la carte mémoire.

source: the name of an image file that shall contain an exif tag
fr: le nom d'une image qui doit contenir des informations exif

source: the date when the picture was taken or stored by the camera found in the exif tag or None if no date could be found.
fr: le moment où la photographie a été prise ou enregistrée sur la carte mémoire indiqué par les champs exif, ou None si ce moment ne peut être déterminé.
