Repository: s-ball/pyimgren
Catalog: docs/locale/*/LC_MESSAGES/localisation.po
Languages: fr

source: Internationalization
fr: Internationalisation

source: :mod:`pyimgren` is a fully internationalized package. The French translations are provided for the source files and the documentation.
fr: :mod:`pyimgren` est un paquet totalement internationalisé. Les traductions françaises sont fournies pour les fichiers source et la documentation.

source: If you use it as a module, and want to use that feature, you just have to call the :func:`~pyimgren.renamer.nls_init` function::
fr: Si vous l'utilisez comme un module et voulez utiliser cette fonctionalité, il suffit d'appeler la fonction :func:`~pyimgren.renamer.nls_init` ::

source: If the ``LANG`` environment variable is present, it is used to define the locale that will be used by :program:`pyimgren`. Else the default locale is used.
fr: Si la variable d'environnement ``LANG`` est présente, elle est utilisée pour définir le paramètre régional qui sera utilisé par :program:`pyimgren`. Sinon c'est le paramètre régional par défaut qui est utilisé.

source: Localisation of the code
fr: Localisation du code

source: You should use the `GNU gettext tools`_ to generate the POT files for :file:`cmdline.py` and :file:`pyimgren.py`. The fully translated PO files are expected to be in the locale folder. For a language ``ll`` (resp. ``ll_CC``) they should be named :file:`pyimgren-ll.po` and :file:`cmdline-ll.po` (resp. :file:`pyimgren-ll_CC.po` and :file:`cmdline-ll_CC.po`)
fr: Vous devriez utiliser les `outils GNU gettext`_ pour générer les fichiers POT pour :file:`cmdline.py` et :file:`pyimgren.py`. Les fichiers PO complètement traduits sont attendus dans le dossier ``locale``. Pour une langue ``ll`` (resp. ``ll_CC``) ils devraient s'appeler :file:`pyimgren-ll.po` et :file:`cmdline-ll.po)` (resp. :file:`pyimgren-ll_CC.po` et :file:`cmdline-ll_CC.po`)

source: That way they will be automatically compiled at build time to the corresponding MO file and will be used at run time.
fr: Ainsi, ils seront automatiquement compilés en fichiers MO au moment du *build* pour être utilisés à l'exécution.

source: Localisation of the documentation
fr: Localisation de la documentation

source: You will need to install `sphinx-intl`_::
fr: Vous devrez installer `sphinx-intl`_ ::

source: Alternatively, the package is automatically installed along with the ``pyimgren`` package it you ask for the ``docs`` options at install time::
fr: Sinon, le paquet est automatiquement installé avec le paquet ``pyimgren`` si vous demandez l'option ``docs`` à l'installation ::

source: Once installed, you can generate the POT files in the ``_build/gettext`` folder with::
fr: Une fois installé, vous pouvez générer les fichiers POT dans le dossier ``_build/gettext`` avec ::

source: and prepare (or update) the PO files for the ``ll`` locale with::
fr: et préparer (ou mettre à jour) les fichier PO pour le paramètre régional ``ll`` avec ::

source: The PO files will end in the ``docs/locale/ll/LC_MESSAGES`` folder.
fr: Les fichiers PO finiront dans le dossier ``docs/locale/ll/LC_MESSAGES``.

source: You will have to edit them to add all the translated strings. You will then generate the translated documentation on a Unix-like system with (assuming a sphinx >= 1.3)::
fr: Vous devrez les éditer pour ajouter les chaînes traduites. Vous génèrerez ensuite la documentation traduite sur un système Unix ou équivalent avec (en supposant un sphinx >= 1.3) ::

source: and on Windows with::
fr: et sur Windows avec ::

source: Have everything on ReadTheDocs
fr: Tout mettre sur ReadTheDocs

source: I maintain a documentation project for ``pyimgren`` on `Read the Docs <https://about.readthedocs.com/>`_. So the English documentation is directly accessible at `<https://pyimgren.readthedocs.io/>`_
fr: Je maintiens un projet de documentation pour ``pyimgren`` sur `Read the Docs <https://about.readthedocs.com/>`_. Ainsi la documentation en anglais est directement accessible en `<https://pyimgren.readthedocs.io/>`_

source: I also maintain (manually) a companion project for the French documentation.
fr: Je maintiens également (à la main) un projet secondaire pour la documentation en français.

source: If you have a translation that you would like to be there, you should contact me through an issue on GitHub, or directly by mail.
fr: Si vous avez une traduction que vous aimeriez voir ici, vous devriez me contacter par une fiche (*issue*) sur GitHub ou directement par mail.
