Repository: s-ball/pyimgren
Catalog: docs/locale/*/LC_MESSAGES/overview.po
Languages: fr

source: Overview
fr: Présentation

source: Goal
fr: Objectif

source: Digital cameras name their pictures in a sequential manner. When you want to put pictures from several cameras in the same folder, they will be sorted by camera instead of by picture date and time.
fr: Les appareils photos numériques nomment les images de façon séquentielle. Quand vous voulez mettre les images provenant de plusieurs appareils dans le même dossier, elles seront triées par appareil et non en fonction de leur date et heure.

source: Even if we can find here and there programs that allow for batch renaming of such pictures, I could not find a portable Python module for that. So the goals of this project are:
fr: Même s'il est possible de trouver ici ou là des programmes qui permettent de faire du renommage par lot de ces images, je n'ai pas réussi à trouver un module Python portable pour cela. Donc les objectifs de ce projet sont:

source: few dependencies: a Python 3 (tested for Python >= 3.9)
fr: peu de dépendances : un Python 3 (testé avec >= 3.9)

source: few additional module requirements: only piexif_ and i18nparse_ are required at installation time
fr: peu d'exigences en modules additionels : seulement piexif_ et i18nparse_ sont nécessaires à l'installation

source: portability: this is a pure Python package and is tested with Appveyor (Windows and Linux) for versions 3.9 to 3.13.
fr: Portabilité : c'est un paquet Python pur, testé avec Appveyor (Windows et Linux) pour les versions 3.9 à 3.13.

source: It is intended to be an importable package that can be included in other Python project, as well as a command line utility that can be launched from a shell.
fr: Il a vocation à être un paquet importable qui peut être inclus dans d'autres projets Python, ainsi qu'un utilitaire en ligne de commande qui peut être lancé depuis un shell

source: Features
fr: Fonctionnalités

source: The central class of the package is :class:`~pyimgren.renamer.Renamer`. It normally acts on a single folder passed at initialization time. It should be given a ``strftime`` format string and an extension (starting with a dot like ``.jpg``). It can then:
fr: La classe centrale du paquet est :class:`~pyimgren.renamer.Renamer`. Elle agit normalement sur un dossier unique indiqué à l'initialisation. Il est possible de lui donner une chaîne en format ``strftime`` et une extension (commençant par un point comme ``.jpg``). Elle peut alors :

source: rename files from the folder given by their names of by patterns to a name constructed with the date from the exif tag, the ``strftime`` format string and the extension. When more than one file should get the same name, the following are given names suffixed with ``a`` to ``zz`` before the extension.
fr: renommer les fichiers du dossier désignés par leur nom ou par un modèle avec un nom construit à partir de la date du champ exif, la chaîne en format ``strftime`` et l'extension. Quand plus d'un fichier devrait recevoir le même nom, les suivants reçoivent des noms suffixés par ``a`` à ``z`` avant l'extension.

source: For example with a ``"%Y%m%d"`` mask and a ``".jpeg"`` extension, 2 pictures from the 10 september 2016 will be given the names ``"20160910.jpeg"`` and ``"20160910a.jpeg"``. Optionally, you can pass a delta in minutes to add to the time extracted for the exif tag.
fr: Par exemple, avec un masque ``"%Y%m%d"`` et une extension ``".jpeg"``, 2 images du 10 septembre 2016 recevront les noms ``"20160910.jpeg"`` et ``"20160910a.jpeg"``. Il est également possible de passer un décalage en minutes à rajouter à l'heure extraite du champ exif.

source: rename back files from the folder to their original names. For that, :meth:`~pyimgren.renamer.Renamer.rename` creates a special file in the folder (by default :file:`names.log`) to record the new and original names. Optionally it can operate on a limited set of the renamed pictures.
fr: redonner aux fichiers du dossier leur nom original. Pour cela, :meth:`~pyimgren.renamer.Renamer.rename` crée un fichier spécial dans le dossier (par défaut :files:`names.log`) pour enregistrer les noms nouveaux et originaux. En option, il peut agir sur un ensemble limité des images renommées.

source: merge files from a different directory. The files are directly copied from their original folder with their final name based on their exif timestamp.
fr: fusionner des fichiers provenant d'un autre répertoire. Les fichiers sont directement copiés depuis leur dossier d'origine sous leur nom définitif basé sur leur date et heure exif.

source: Dependencies
fr: Dépendances

source: This package has few requirements:
fr: Ce paquet a peu d'exigences

source: a Python >= 3 (only tested with >= 3.9)
fr: un Python >= 3 (testé seulement pour >=3.9)

source: the piexif_ package available from PyPI and automatically installed in a `pip` installation.
fr: le paquet piexif_ disponible sur PyPI et installé automatiquement lors d'une installation par ``pip``.

source: the i18nparse_ package available from PyPI, and automatically installed too.
fr: le paquet i18nparse_ disponible sur PyPI, et également installé automatiquement

source: Internationalization
fr: Internationalisation

source: This package supports gettext type localization, and provides French messages in addition to English.
fr: Ce paquet accepte une localisation de type gettext, et fournit des messages en français en plus de l'anglais.

source: Limits
fr: Limitations

source: The upcoming 1.0 version breaks a lot of compatibility with previous ones.
fr: La future version 1.0 introduit de nombreuses pertes de compatibilité

source: The documentations (both English and French) are still a work in progress...
fr: Les documentations (en français et en anglais) sont encore en travaux ...
