Repository: s-ball/pyimgren
Catalog: docs/locale/*/LC_MESSAGES/usage.po
Languages: fr

source: Usage
fr: Utilisation

source: As a Python module
fr: Comme un module Python

source: Simple usage
fr: Utilisation simple

source: You only have to import :mod:`pyimgren` and create a :class:`~pyimgren.pyimgren.Renamer`::
fr: Il suffit d'importer :mod:`pyimgren` et de créer un :class:`~pyimgren.pyimgren.Renamer`::

source: and that's all...
fr: et c'est tout ...

source: You can then use the :meth:`~.rename` and :meth:`~.back` methods to rename pictures forth and back::
fr: Vous pouvez ensuite utiliser les méthodes :meth:`~.rename` et :meth:`~.back` pour renommer les images dans un sens et dans l'autre ::

source: You can also merge files from a different directory. It makes sense when you want to pick pictures from another camera::
fr: Il est également possible de fusionner des fichiers provenant d'un autre répertoire. Cela prend tout son sens si vous vouler récupérer des images prises par un autre appareil photo ::

source: Mid-level usage
fr: Utilisation intermédaire

source: All messages from the :mod:`pyimgren` module go through the :mod:`logging` module. If you want debug messages to be actually printed, you **must** configure a non default handler processing that level before using :meth:`~.rename`, :meth:`~.back` and :meth:`~.merge`, methods with a `debug=True` parameter::
fr: Tous les messages du module :mod:`pyimgren` passent par le module :mod:`logging`. Pour afficher les messages de niveau déverminage (*debug*), il **faut** configurer un *handler* traitant ce niveau avant d'utiliser les méthodes :meth:`~.rename`, :meth:`~.back` and :meth:`~.merge` avec un paramètre `debug=True` ::

source: You can automatically process sub folders. If `thumbnails` is a subfolder of the current folder, you can use::
fr: Il est possible de traiter automatiquement des sous-dossiers. Si `thumbnails` est un sous-dossier du dossier courant, vous pouvez faire ::

source: This will automatically start a new :class:`~.Renamer` in ``thumbnails`` with the exact same options as ``ren`` and call :meth:`~.rename` on it. But **beware**:
fr: Cela lancera automatiquement un nouveau :class:`~.Renamer` dans ``thumbnails`` avec exactement les même options que ``ren`` and appelera la méthode :meth:`~.rename` dans le sous-dossier. Mais **attention** :

source: this will process all files matching the ``src_mask`` parameter of ``ren``
fr: cela traitera tous les fichiers correspondant au paramètre ``src_mask`` de ``ren``

source: this will create a ``names.log`` file (or more exactly a file for which the name is the value of the ``ref_file`` parameter) in the ``thumbnails`` directory.
fr: cela créera un fichier ``names.log`` (ou plus exactement un fichier dont le nom est la valeur du paramère ``ref_file``) dans le répertoire ``thumbnails``.

source: Long story made short, it can make sense and is actually used in the command line interface, but it does not allow to process folders that are not descendant from the ``ren`` folder, nor to specify a limited list of files.
fr: En résumé, cela prend tout son sens et c'est effectivement utilisé dans l'interface en mode ligne, mais cela ne permet pas de traiter des dossiers qui ne sont pas au dessous du dossier de ``ren``, ni de spécifier une liste réduite de fichiers.

source: Advanced usage
fr: Utilisation avancée

source: If you want to build a complete front end for :mod:`pyimgren`, you will probably be interested by the others methods from :class:`~.Renamer` and the function :func:`~.exif_dat`.
fr: Si vous voulez construire une interface complète au dessus de :mod:`pyimgren`, vous serez probablement intéressés par les autres méthodes de :class:`~.Renamer` et par la fonction :func:`~.exif_dat`.

source: This last one tries its best to extract an exif timestamp from a file and returns ``None`` if it could not find one. You can use it to easily build a dictionary ``{file_name: exif_timestamp}`` from a list of picture names::
fr: Cette dernière fait de son mieux pour extraire une date et une heure exif d'un fichier et renvoie ``None`` si elle ne peut pas en trouver. Vous pouvez l'utiliser pour construire un dictionnaire``{file_name: exif_timestamp}`` à partir d'une liste de noms d'images ::

source: It is guaranteed to never raise an exception.
fr: Elle garantit de ne jamais lever d'exception.

source: The other methods from :class:`~.Renamer`, namely :meth:`~.load_names` and :meth:`~.get_new_name` respectively load the names of pictures which have been renamed (both new name and original one), and find what would be the new name of a file with respect to the ``a`` to ``zz`` suffixes. Examples::
fr: Les autres méthodes de :class:`~.Renamer`, à savoir :meth:`~.load_names` et :meth:`~.get_new_name` servent respectivement à charger les noms des images qui ont été renommées (à la fois le nouveau nom et le nom d'origine), et de déterminer ce que serait le nouveau nom d'un fichier en tenant compte des suffixes ``a`` à ``zz``. Examples ::

source: or::
fr: ou ::

source: From the command line
fr: Depuis la ligne de commande

source: The package provides a command line interface to the :class:`~.Renamer` class.
fr: Ce paquet fournie une interface en ligne de commande pour la classe :class:`~.Renamer`

source: Syntax:
fr: Syntaxe ::

source: and for sub-commands:
fr: et pour les sous-commandes :

source: or:
fr: ou :

source: This internally starts a :class:`~.Renamer` with the options passed as parameter. If option ``-D|--debug`` is present a :class:`StreamHandler` is configured to process Debug level message in the :mod:`logging` module. Then, the :class:`~.Renamer` runs its :meth:`~.rename` method if the ``-b|--back`` option is not present, else the :meth:`~.back` method.
fr: Ceci lance en interne un :class:`~.Renamer` avec les options passées en paramètre. Si l'option ``-D|--debug`` est présente, un :class:`StreamHandler` est configuré pour traiter les messages de niveau déverminage (*Debug*) dans le module :mod:`logging`. Ensuite, le :class:`~.Renamer` exécute sa méthode :meth:`~.rename` si l'option ``-b|--back`` est absente, sinon la méthode :meth:`~.back`.

source: Default values:
fr: Valeurs par défaut :

source: All (global) options have default values::
fr: Toutes les options (globales) ont des valeurs par défaut ::

source: Options ``debug`` and ``dry_run`` are inactive by default.
fr: Les options ``debug`` et ``dry_run`` sont inactives par défaut.

source: Special case
fr: Cas particuliers

source: On Windows, the Python script directories are commonly not in the PATH, and users use the :program:`py` launcher to start the interpretor or the scripts. In that case, the ``pyimgren`` package can be started from the command line as a module:
fr: Sous Windows, le répertoire des scripts de Python n'est généralement pas dans le chemin de recherche (*PATH*), et les utilisateurs utilisent le lanceur :program:`py` pour appeler l'interpréteur ou les scripts. Dans ce cas, le paquet ``pyimgren`` peut être lancé depuis la ligne de commande comme un module :

source: The parameters are exactly the same they were for the script.
fr: Les paramètres sont exactement les mêmes que pour le script.
