Repository: s-ball/pyimgren
Catalog: pyimgren/locale/main-*.po
Languages: fr

source: Rename pictures according to their exif timestamp
fr: Renomme des images en fonction de leur date exif

source: show program's version number and exit
fr: affiche le numéro de version du programme et termine l'exécution

source: folder containing files to rename
fr: dossier contenant les fichiers à renommer

source: pattern to select the files to rename
fr: modèle des fichiers à renommer

source: format for the new file name
fr: format des nouveaux noms des fichiers

source: extension for the new file name
fr: extension des nouveaux noms des fichiers

source: a file to remember the old names
fr: un fichier pour enregistrer les anciens noms

source: number of minutes to add to exif time
fr: nombre de minutes à ajouter à l'heure du champ exif

source: print a line per rename
fr: affiche une ligne par fichier renommé

source: process normally except no rename occurs
fr: fonctionne normallement mais ne renomme aucun fichier

source: sub-commands
fr: sous-commandes

source: rename files by using their exif timestamp
fr: renomme des fichiers en fonction de leur date exif

source: files to process (default: src_mask)
fr: fichiers à traiter (par défaut : src_mask)

source: rename files back to their original name
fr: renomme les fichiers avec leur nom d'origine

source: files to process (default: content of ref_file)
fr: fichier à traiter (par défaut le contenu de ref_file)

source: merge files from a different folder
fr: fusionne des fichiers provenant d'un autre dossier

source: folder from where merge picture files
fr: dossier à partir d'où fusionner les fichiers image
